app/controllers/courses_controller.rb

  def open
    @course = Course.find_by_id(params[:id])
    @course.update_attributes(:open=>true)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "t"], ["updated_at", "2016-11-19 02:45:04.871576"], ["id", 1]]

  def close
    @course = Course.find_by_id(params[:id])
    @course.update_attributes(:open=>false)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "f"], ["updated_at", "2016-11-19 02:48:23.471344"], ["id", 1]]